export const mockTrend = {
  // 修改 xAxis 可控制趋势图的横轴检查日期。
  xAxis: [
    "08/09",
    "08/10",
    "08/11",
    "08/12",
    "08/13",
    "08/14",
    "08/15",
    "08/16",
    "08/17",
    "08/18",
    "08/19",
    "08/20",
    "08/21",
    "08/22",
    "08/23",
  ],
  // 修改 series[].data 可控制每条 y 轴使用率曲线。
  series: [
    {
      name: "CPU",
      color: "#2e78d2",
      data: [31, 34, 29, 39, 42, 38, 44, 41, 47, 43, 49, 46, 52, 48, 51],
    },
    {
      name: "Memory",
      color: "#198b68",
      data: [46, 47, 48, 48, 50, 51, 50, 53, 54, 53, 55, 56, 57, 58, 59],
    },
    {
      name: "Disk",
      color: "#d48329",
      data: [46, 47, 48, 48, 50, 51, 50, 53, 54, 53, 55, 56, 57, 58, 59],
    },
  ],
};

export const mockComparison = {
  // 修改 xAxis 可控制对比图的主机标签。
  xAxis: ["192.168.122.18", "192.168.122.147"],
  series: [
    { name: "CPU", data: [31, 67] },
    { name: "Memory", data: [39, 72] },
    { name: "Disk", data: [32, 58] },
  ],
};
